### Reading Data From Different Sources

In [1]:
import pandas as pd
from io import StringIO
Data = '{"employee_name": "James", "email": "james@gmail.com", "job_profile": [{"title1":"Team Lead", "title2":"Sr. Developer"}]}'
df=pd.read_json(StringIO(Data))

In [2]:
Data = '''
[
  {
    "employee_name": "James",
    "email": "james@gmail.com",
    "job_profile": [{"title1": "Team Lead", "title2": "Sr. Developer"}]
  },
  {
    "employee_name": "Isha",
    "email": "isha@example.com",
    "job_profile": [{"title1": "Project Manager", "title2": "Product Owner"}]
  },
  {
    "employee_name": "Rahul",
    "email": "rahul@example.com",
    "job_profile": [{"title1": "Intern", "title2": "Jr. Developer"}]
  }
]
'''

df1=pd.read_json(StringIO(Data))
df1

,employee_name,email,job_profile
0,James,james@gmail.com,"[{'title1': 'Team Lead', 'title2': 'Sr. Develo..."
1,Isha,isha@example.com,"[{'title1': 'Project Manager', 'title2': 'Prod..."
2,Rahul,rahul@example.com,"[{'title1': 'Intern', 'title2': 'Jr. Developer'}]"

In [3]:
df

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [4]:
df.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [5]:
df1.to_json()

'{"employee_name":{"0":"James","1":"Isha","2":"Rahul"},"email":{"0":"james@gmail.com","1":"isha@example.com","2":"rahul@example.com"},"job_profile":{"0":[{"title1":"Team Lead","title2":"Sr. Developer"}],"1":[{"title1":"Project Manager","title2":"Product Owner"}],"2":[{"title1":"Intern","title2":"Jr. Developer"}]}}'

In [7]:
df1.to_json(orient='index')

'{"0":{"employee_name":"James","email":"james@gmail.com","job_profile":[{"title1":"Team Lead","title2":"Sr. Developer"}]},"1":{"employee_name":"Isha","email":"isha@example.com","job_profile":[{"title1":"Project Manager","title2":"Product Owner"}]},"2":{"employee_name":"Rahul","email":"rahul@example.com","job_profile":[{"title1":"Intern","title2":"Jr. Developer"}]}}'

In [8]:
df1.to_json(orient='records')

'[{"employee_name":"James","email":"james@gmail.com","job_profile":[{"title1":"Team Lead","title2":"Sr. Developer"}]},{"employee_name":"Isha","email":"isha@example.com","job_profile":[{"title1":"Project Manager","title2":"Product Owner"}]},{"employee_name":"Rahul","email":"rahul@example.com","job_profile":[{"title1":"Intern","title2":"Jr. Developer"}]}]'

In [11]:
df=pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data",header=None)

In [12]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [13]:
df.to_csv("wine.csv")

In [13]:
!pip install lxml

Collecting lxml
  Downloading lxml-5.2.2-cp312-cp312-win_amd64.whl.metadata (3.5 kB)
Downloading lxml-5.2.2-cp312-cp312-win_amd64.whl (3.8 MB)
   ---------------------------------------- 0.0/3.8 MB ? eta -:--:--
   ---------------------------------------- 0.0/3.8 MB ? eta -:--:--
   ---------------------------------------- 0.0/3.8 MB 660.6 kB/s eta 0:00:06
   ---------------------------------------- 0.0/3.8 MB 660.6 kB/s eta 0:00:06
   ---------------------------------------- 0.0/3.8 MB 660.6 kB/s eta 0:00:06
   - -------------------------------------- 0.2/3.8 MB 756.6 kB/s eta 0:00:05
   ---- ----------------------------------- 0.4/3.8 MB 1.8 MB/s eta 0:00:02
   -------- ------------------------------- 0.8/3.8 MB 2.8 MB/s eta 0:00:02
   -------------- ------------------------- 1.3/3.8 MB 3.9 MB/s eta 0:00:01
   --------------- ------------------------ 1.4/3.8 MB 4.1 MB/s eta 0:00:01
   --------------- ------------------------ 1.4/3.8 MB 4.1 MB/s eta 0:00:01
   ---------------- ----------------------- 1.5/3.8 MB 3.3 MB/s eta 0:00:01
   ------------------ --------------------- 1.8/3.8 MB 3.3 MB/s eta 0:00:01
   ---------------------- ----------------- 2.1/3.8 MB 3.6 MB/s eta 0:00:01
   -------------------------- ------------- 2.5/3.8 MB 4.0 MB/s eta 0:00:01
   ---------------------------- ----------- 2.7/3.8 MB 4.2 MB/s eta 0:00:01
   ---------------------------- ----------- 2.7/3.8 MB 4.2 MB/s eta 0:00:01
   ---------------------------- ----------- 2.7/3.8 MB 4.2 MB/s eta 0:00:01
   ------------------------------ --------- 2.9/3.8 MB 3.5 MB/s eta 0:00:01
   --------------------------------- ------ 3.2/3.8 MB 3.7 MB/s eta 0:00:01
   ------------------------------------ --- 3.5/3.8 MB 3.9 MB/s eta 0:00:01
   ---------------------------------------  3.8/3.8 MB 4.1 MB/s eta 0:00:01
   ---------------------------------------- 3.8/3.8 MB 4.0 MB/s eta 0:00:00
Installing collected packages: lxml
Successfully installed lxml-5.2.2

In [17]:
!pip install html5lib
!pip install beautifulsoup4

Requirement already satisfied: html5lib in e:\udemy final\python\venv\lib\site-packages (1.1)
Requirement already satisfied: six>=1.9 in e:\udemy final\python\venv\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in e:\udemy final\python\venv\lib\site-packages (from html5lib) (0.5.1)
Collecting beautifulsoup4
  Using cached beautifulsoup4-4.12.3-py3-none-any.whl.metadata (3.8 kB)
Collecting soupsieve>1.2 (from beautifulsoup4)
  Using cached soupsieve-2.5-py3-none-any.whl.metadata (4.7 kB)
Using cached beautifulsoup4-4.12.3-py3-none-any.whl (147 kB)
Using cached soupsieve-2.5-py3-none-any.whl (36 kB)
Installing collected packages: soupsieve, beautifulsoup4
Successfully installed beautifulsoup4-4.12.3 soupsieve-2.5

In [14]:
url="https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/"

df=pd.read_html(url)

In [17]:
df[0].head()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544

In [23]:
url="https://en.wikipedia.org/wiki/Mobile_country_code"
df2=pd.read_html(url)
df2[2].head()

,MCC,MNC,Brand,Operator,Status,Bands (MHz),References and notes
0,901,1,NaN,Webbing,Unknown,MVNO,Former ICO Satellite Management[51][52]
1,901,2,NaN,GlobalmatiX AG,Unknown,Unknown,Former Sense Communications International; veh...
2,901,3,Iridium,NaN,Operational,Satellite,NaN
3,901,4,NaN,BBIX Singapore Pte. Ltd.,Unknown,Unknown,Former Globalstar[54]
4,901,5,NaN,Thuraya RMSS Network,Operational,Satellite,NaN

In [24]:
df_excel=pd.read_excel('data.xlsx')

In [25]:
df_excel

    Name  Age
0  Krish   32
1   Jack   34
2   John   31

In [26]:
df_excel.to_pickle('df_excel')

In [27]:
pd.read_pickle('df_excel')

    Name  Age
0  Krish   32
1   Jack   34
2   John   31